STMicroelectronics/STM32CubeWBA/Projects/STM32WBA55G-DK1/Applications/BLE/BLE_Audio_TMAP_Central/STM32_WPAN/App/app_bsp.c
#ifdef CFG_BSP_ON_DISCOVERY
#if (CFG_LCD_SUPPORTED == 1)

/**
 * @brief  Initialisation of the LCD screen on used Discovery board.
 */
void APP_BSP_LcdInit( void )
{
  int32_t   iStatus;

  /* LCD Initialisation */
  iStatus = BSP_LCD_Init( LCD1, LCD_ORIENTATION_LANDSCAPE );
  if ( iStatus == BSP_ERROR_NONE )
  {
    iStatus = BSP_LCD_DisplayOn( LCD1 );
  }

  if ( iStatus == BSP_ERROR_NONE )
  {
    /* LCD Management Initialisation */
    UTIL_LCD_SetFuncDriver( &LCD_Driver );

    /* Clear the Background Layer */
    UTIL_LCD_Clear( LCD_COLOR_BLACK );

    /* Select font and Color */
    UTIL_LCD_SetFont( &Font12 );
    UTIL_LCD_SetBackColor( LCD_COLOR_BLACK );
    UTIL_LCD_SetTextColor( LCD_COLOR_WHITE );
  }
}
#endif /* (CFG_LCD_SUPPORTED == 1) */

/*************************************************************
 *
 * LOCAL FUNCTIONS
 *
 *************************************************************/

#if (CFG_JOYSTICK_SUPPORTED == 1)
/**
 * @brief  Launch the Task selected by the joystick.
 *
 * @param  joystickState  position of joystick.
 * @retval None
 */
static void Joystick_LaunchActionTask( JOYPin_TypeDef joystickState )
{
  switch ( joystickState )
  {
#ifdef CFG_BSP_ON_FREERTOS
    case JOY_NONE:
        osSemaphoreRelease( JoystickNoneSemaphore );
        break;

    case JOY_UP:
        osSemaphoreRelease( JoystickUpSemaphore );
        break;

    case JOY_RIGHT:
        osSemaphoreRelease( JoystickRightSemaphore );
        break;

    case JOY_DOWN:
        osSemaphoreRelease( JoystickDownSemaphore );
        break;

    case JOY_LEFT:
        osSemaphoreRelease( JoystickLeftSemaphore );
        break;

    case JOY_SEL:
        osSemaphoreRelease( JoystickSelectSemaphore );
        break;
#endif /* CFG_BSP_ON_FREERTOS */
#ifdef CFG_BSP_ON_THREADX
    case JOY_NONE:
        tx_semaphore_put( &JoystickNoneSemaphore );
        break;

    case JOY_UP:
        tx_semaphore_put( &JoystickUpSemaphore );
        break;

    case JOY_RIGHT:
        tx_semaphore_put( &JoystickRightSemaphore );
        break;

    case JOY_DOWN:
        tx_semaphore_put( &JoystickDownSemaphore );
        break;

    case JOY_LEFT:
        tx_semaphore_put( &JoystickLeftSemaphore );
        break;

    case JOY_SEL:
        tx_semaphore_put( &JoystickSelectSemaphore );
        break;
#endif /* CFG_BSP_ON_THREADX */
#ifdef CFG_BSP_ON_SEQUENCER
    case JOY_NONE:
        UTIL_SEQ_SetTask( 1U << CFG_TASK_BSP_JOY_NONE, CFG_SEQ_PRIO_0 );
        break;

    case JOY_UP:
        UTIL_SEQ_SetTask( 1U << CFG_TASK_BSP_JOY_UP, CFG_SEQ_PRIO_0 );
        break;

    case JOY_RIGHT:
        UTIL_SEQ_SetTask( 1U << CFG_TASK_BSP_JOY_RIGHT, CFG_SEQ_PRIO_0 );
        break;

    case JOY_DOWN:
        UTIL_SEQ_SetTask( 1U << CFG_TASK_BSP_JOY_DOWN, CFG_SEQ_PRIO_0 );
        break;

    case JOY_LEFT:
        UTIL_SEQ_SetTask( 1U << CFG_TASK_BSP_JOY_LEFT, CFG_SEQ_PRIO_0 );
        break;

    case JOY_SEL:
        UTIL_SEQ_SetTask( 1U << CFG_TASK_BSP_JOY_SELECT, CFG_SEQ_PRIO_0 );
        break;
#endif /* CFG_BSP_ON_SEQUENCER */
    default :   /* No Action */
                break;
  }
}

/**
 *
 */
static void APP_BSP_JoystickTimerCallback(void *arg)
{
#ifdef CFG_BSP_ON_FREERTOS
  osSemaphoreRelease( JoystickActionSemaphore );
#endif /* CFG_BSP_ON_FREERTOS */
#ifdef CFG_BSP_ON_THREADX
  tx_semaphore_put( &JoystickActionSemaphore );
#endif /* CFG_BSP_ON_THREADX */
#ifdef CFG_BSP_ON_SEQUENCER
  UTIL_SEQ_SetTask( 1U << CFG_TASK_BSP_JOY_TIMER, CFG_SEQ_PRIO_0);
#endif /* CFG_BSP_ON_SEQUENCER */
}

/**
 *
 */
static int32_t APP_BSP_JoystickGetState( JOY_TypeDef eJoystick, uint32_t lWaitTime )
{
  int32_t   retval;
  int32_t   startadc;
  uint16_t  keyconvertedvalue;

  /* No ADC conversion */
  startadc = 0UL;

  /* Check if ADC conversion is ongoing */
  if(LL_ADC_REG_IsConversionOngoing(hjoy_adc[eJoystick].Instance) == 1UL)
  {
     /* ADC already started */
     startadc = 1UL;
  }
  else
  {
    /* Start the conversion process */
    if (HAL_ADC_Start(&hjoy_adc[eJoystick]) != HAL_OK)
    {
      retval = BSP_ERROR_PERIPH_FAILURE;
    }
    else
    {
      /* Wait for the end of conversion */
      if (HAL_ADC_PollForConversion(&hjoy_adc[eJoystick], lWaitTime) != HAL_OK)
      {
        retval = BSP_ERROR_PERIPH_FAILURE;
      }
      else
      {
        /* ADC started */
        startadc = 1UL;
      }
    }
  }

  /* If ADC is well started */
  if( startadc == 1UL)
  {
    /* Get the converted value of regular channel */
    keyconvertedvalue = HAL_ADC_GetValue(&hjoy_adc[eJoystick]);

    /* The ADC value gives the pad pressed */

    if ((keyconvertedvalue >= 2800U) && (keyconvertedvalue < 3600U))
    {
#if defined (STM32WBA55xx)
      retval = JOY_DOWN;
#elif defined (STM32WBA65xx)
      retval = JOY_RIGHT;
#endif
    }
    else if ((keyconvertedvalue >= 2000U) && (keyconvertedvalue < 2800U))
    {
#if defined (STM32WBA55xx)
      retval = JOY_RIGHT;
#elif defined (STM32WBA65xx)
      retval = JOY_UP;
#endif
    }
    else if ((keyconvertedvalue >= 1200U) && (keyconvertedvalue < 2000U))
    {
#if defined (STM32WBA55xx)
      retval = JOY_LEFT;
#elif defined (STM32WBA65xx)
      retval = JOY_DOWN;
#endif
    }
    else if ((keyconvertedvalue >= 400U) && (keyconvertedvalue < 1200U))
    {
#if defined (STM32WBA55xx)
      retval = JOY_UP;
#elif defined (STM32WBA65xx)
      retval = JOY_LEFT;
#endif
    }
    else if (keyconvertedvalue < 400U)
    {
#if defined (STM32WBA55xx)
      retval = JOY_SEL;
#elif defined (STM32WBA65xx)
      retval = JOY_SEL;
#endif
    }
    else
    {
      retval = JOY_NONE;
    }
  }

  return retval;
}

/**
 *
 */
static void APP_BSP_JoystickActionHandle(void)
{
#if ( CFG_JOYSTICK_TYPE_BUTTON == 1 )
  static JOYPin_TypeDef   eJoystickPreviousState = JOY_NONE;
#endif /* ( CFG_JOYSTICK_TYPE_BUTTON == 1 ) */
  int32_t ret;
  static JOYPin_TypeDef   eJoystickState;

  /* Init, Sample & DeInit Joystick */
  BSP_JOY_Init( JOY1, JOY_MODE_POLLING, JOY_ALL );

  /* Get Joystick position */
  ret = APP_BSP_JoystickGetState( JOY1, ( JOYSTICK_PRESS_SAMPLE_MS / 2u ) );

  BSP_JOY_DeInit(JOY1, JOY_ALL);

  if(ret >= 0)
  {
    eJoystickState = (JOYPin_TypeDef)ret;
#if ( CFG_JOYSTICK_TYPE_BUTTON == 1 )
    /* Send a Callback only when Button is on a new position */
    if ( eJoystickState != eJoystickPreviousState )
    {
      Joystick_LaunchActionTask( eJoystickState );
    }

    eJoystickPreviousState = eJoystickState;
#else /* ( CFG_JOYSTICK_TYPE_BUTTON == 1 ) */
    /* Send a Callback when Button is on another position than JOY_NONE */
    if ( eJoystickState != JOY_NONE )
    {
      Joystick_LaunchActionTask( eJoystickState );
    }
#endif /* ( CFG_JOYSTICK_TYPE_BUTTON == 1 ) */
  }

  /*Re-launch the Joystick Timer*/
  UTIL_TIMER_Start(&joystickTimer);
}

#ifdef CFG_BSP_ON_FREERTOS
/**
 * @brief  Management of the Joystick Action task
 * @param  argument  Not used.
 * @retval None
 */
static void JoystickActionTask( void * argument )
{
  UNUSED( argument );

  for(;;)
  {
    osSemaphoreAcquire( JoystickActionSemaphore, osWaitForever );
    APP_BSP_JoystickActionHandle();
  }
}
/**
 * @brief  Management of the Joystick Up task
 * @param  argument  Not used.
 * @retval None
 */
static void JoystickNoneTask( void * argument )
{
  UNUSED( argument );

  for(;;)
  {
    osSemaphoreAcquire( JoystickNoneSemaphore, osWaitForever );
    APP_BSP_JoystickNoneAction();
  }
}

/**
 * @brief  Management of the Joystick Up task
 * @param  argument  Not used.
 * @retval None
 */
static void JoystickUpTask( void * argument )
{
  UNUSED( argument );

  for(;;)
  {
    osSemaphoreAcquire( JoystickUpSemaphore, osWaitForever );
    APP_BSP_JoystickUpAction();
  }
}

/**
 * @brief  Management of the Joystick Right task
 * @param  argument  Not used.
 * @retval None
 */
static void JoystickRightTask( void * argument )
{
  UNUSED( argument );

  for(;;)
  {
    osSemaphoreAcquire( JoystickRightSemaphore, osWaitForever );
    APP_BSP_JoystickRightAction();
  }
}

/**
 * @brief  Management of the Joystick Down task
 * @param  argument  Not used.
 * @retval None
 */
static void JoystickDownTask( void * argument )
{
  UNUSED( argument );

  for(;;)
  {
    osSemaphoreAcquire( JoystickDownSemaphore, osWaitForever );
    APP_BSP_JoystickDownAction();
  }
}

/**
 * @brief  Management of the Joystick Left task
 * @param  argument  Not used.
 * @retval None
 */
static void JoystickLeftTask( void * argument )
{
  UNUSED( argument );

  for(;;)
  {
    osSemaphoreAcquire( JoystickLeftSemaphore, osWaitForever );
    APP_BSP_JoystickLeftAction();
  }
}

/**
 * @brief  Management of the Joystick Select task
 * @param  argument  Not used.
 * @retval None
 */
static void JoystickSelectTask( void * argument )
{
  UNUSED( argument );

  for(;;)
  {
    osSemaphoreAcquire( JoystickSelectSemaphore, osWaitForever );
    APP_BSP_JoystickSelectAction();
  }
}

/**
 * @brief  Initialisation of the Joystick Tasks & Semaphores
 */
static void Joystick_InitTask( void )
{
  /* Register Semaphore & Task for the Joystick Action Semaphore */
  JoystickActionSemaphore = osSemaphoreNew( 1, 0, NULL );
  JoystickActionThread = osThreadNew( JoystickActionTask, NULL, &JoystickActionThreadAttributes );

